<?php
/**
*
* @package Cookie Policy Extension
* @copyright (c) 2014 david63
* @license http://opensource.org/licenses/gpl-2.0.php GNU General Public License v2
*
* Translated By : Bassel Taha Alhitary - www.alhitary.net
*/

/**
* DO NOT CHANGE
*/
if (!defined('IN_PHPBB'))
{
	exit;
}

if (empty($lang) || !is_array($lang))
{
	$lang = array();
}

// DEVELOPERS PLEASE NOTE
//
// All language files should use UTF-8 as their encoding and the files must not contain a BOM.
//
// Placeholders can now contain order information, e.g. instead of
// 'Page %s of %s' you can (and should) write 'Page %1$s of %2$s', this allows
// translators to re-order the output of data while ensuring it remains correct
//
// You do not need this where single placeholders are used, e.g. 'Message %d' is fine
// equally where a string contains only two placeholders which are used to wrap text
// in a url you again do not need to specify an order e.g., 'Click %sHERE%s' is fine
//
// Some characters you may want to copy&paste:
// ’ » “ ” …
//

$lang = array_merge($lang, array(
	'COOKIE_ACCEPT_TEXT'	=> 'هذا المنتدى يستخدم سياسة تخزين المعلومات لإعطائك تجربة أفضل. استخدامك لهذا المنتدى يعني أنك موافق على هذه السياسة.<br /><br />أنقر على "سياسة تخزين المعلومات" الموجودة في الصفحة الرئيسية لمعرفة المزيد من المعلومات.<br /><br />',
	'COOKIE_ACCEPT'			=> '[ موافق ]',

	'COOKIE_TEXT'			=> '<h3>ماهي سياسة تخزين المعلومات في هذا المنتدى ?</h3>
	<p>نحن نستخدم ملفات معروفة بإسم الكوكيز في %1$s لتحسين أدائها وتعزيز تجربة المستخدم. استخدامك لـ %1$s يعني أنك موافق على أن تكون هذه الملفات موجودة في جهازك.</p>
<h3>ماهو الكوكيز ?</h3><p>الكوكيز عبارة عن ملفات نصية صغيرة الحجم يعمل الموقع على نقلها إلى جهاز الكمبيوتر الخاص بك , أو الموبايل , عند أول زيارة لك للموقع أو لأحد صفحات الموقع.<br /><br />
هناك الكثير من الوظائف التي يمكن أن يقوم بها الكوكيز. على سبيل المثال : يساعد الموقع أو موقع آخر على التعرف على جهازك عند زيارتك التالية. %1$s يستخدم المصطلح "كوكيز" في هذه السياسة للإشارة إلى جميع الملفات التي جمعت المعلومات بهذه الطريقة.<br /><br />
هناك ملفات مُحددة من الكوكيز تحتوي على معلومات شخصية – على سبيل المثال : إذا نقرت على "تذكرني" عند تسجيل دخولك , سيتم حفظ إسم المستخدم الخاص بك في أحد ملفات الكوكيز. معظم ملفات الكوكيز سوف يعمل على عدم حفظ المعلومات الخاصة بهويتك , ولكن سوف يحفظ معلومات عامة كطريقة وصول الأعضاء إلى %1$s وطريقة تصفحهم , أو حفظ معلومات عامة عن مكان العضو.</p>
<h3>مانوع الكوكيز الذي يستخدمه %1$s ?</h3><p>يستطيع الكوكيز تنفيذ الكثير من الوظائف المُتعددة :</p>
<p><b>1. الضرورية</b><br />بعض ملفات الكوكيز تُعتبر أساسية لعمل %1$s. حيث تعمل هذه الملفات على تفعيل بعض الخدمات التي تبحث أنت عنها بصورة خاصة.</p>
<p><b>2. الأداء</b><br />ملفات الكوكيز تعمل على جمع المعلومات الغير معروفة عن الصفحات التي تم زيارتها. على سبيل المثال : يمكن أن نستخدم هذه الملفات لمتابعة أكثر الصفحات شعبية , حيث أن طريقة الربط بين الصفحات تعتبر الأكثر فاعلية ونحدد سبب استلام بعض الصفحات لرسائل الخطأ.</p>
<p><b>3. الفاعلية</b><br />هذه الملفات تحفظ وتتذكر الخيارات التي حددتها لتحسين تصفحك في المنتدى.</p>
<p>%1$s قد تسمح لأطراف ثالثة في حفظ ملفات الكوكيز التي تقع ضمن أي الفئات المذكورة أعلاه. على سبيل المثال , مثل العديد من المواقع , يمكن أن نستخدم خدمة تحليلات جوجل Google Analytics لمساعدتنا في مراقبة حركة نشاط موقعنا.</p>
<h3>هل يستطيع العضو بالمنتدى حظر الكوكيز ?</h3><p>لمعرفة كيفية السماح وإدارة ملفات الكوكيز , راجع قسم المساعدة في متصفحك أو دليل هاتفك المحمول - أو تستطيع زيارة أحد المواقع التالية , والتي ستعطيك معلومات تفصيلية عن طريقة إدارة / رقابة / حذف ملفات الكوكيز.<br /><br />
<a href="http://www.aboutcookies.org" style="text-decoration:none">www.aboutcookies.org</a><br />
<a href="http://www.allaboutcookies.org" style="text-decoration:none">www.allaboutcookies.org</a></p>
<p>نرجوا الإنتباه إلى أنك قد تجد بعض أقسام %1$s لا تعمل بصورة صحيحة إذا أخترت تعطيل الكوكيز.</p>
<h3>ملفات الكوكيز من مواقع الشبكات الإجتماعية في %1$s</h3><p>%1$s قد تحتوي على روابط لمواقع الشبكات الإجتماعية ( مثل : الفيس بوك و تويتر واليوتيوب ). حيث أن هذه المواقع قد تنقل ملفات الكوكيز إلى جهازك و %1$s لا تتحكم في كيفية استخدامهم لهذه الملفات , لذلك %1$s تقترح عليك مراجعة مواقعهم للتأكد من طريقة استخدامهم للكوكيز.',

	'COOKIE_POLICY'			=> 'سياسة تخزين المعلومات',
));
